In [87]:
import numpy as np
import pandas as pd
import matplotlib

# Loaded in the CSV file obtained from:
### https://censusindia.gov.in/census.website/data/census-tables

In [13]:
Dt = pd.read_csv(f"DDW-C16-TOWN-STMT-MDDS-2900.csv")

# Primary exploration of the data to see the shape, features etc

In [19]:
Dt.shape

(15337, 16)

In [125]:
Dt.head(10)

,Table,State,District,Town,Area name,Index,Mother tongue name,Total P,Total Male,Total female
5,C0116,29,000,000000,KARNATAKA,001000,1 ASSAMESE,6887,4784,2103
6,C0116,29,000,000000,KARNATAKA,001002,Assamese,6753,4725,2028
7,C0116,29,000,000000,KARNATAKA,001999,1 Others,134,59,75
8,C0116,29,000,000000,KARNATAKA,002000,2 BENGALI,66368,39763,26605
9,C0116,29,000,000000,KARNATAKA,002007,Bengali,66297,39711,26586
10,C0116,29,000,000000,KARNATAKA,002011,Chakma,51,41,10
11,C0116,29,000,000000,KARNATAKA,002999,2 Others,20,11,9
12,C0116,29,000,000000,KARNATAKA,003000,3 BODO,256,179,77
13,C0116,29,000,000000,KARNATAKA,003001,Bodo/Boro,248,173,75
14,C0116,29,000,000000,KARNATAKA,003003,Kachari,8,6,2

In [25]:
Dt.columns

Index(['C-16 POPULATION BY MOTHER TONGUE', 'Unnamed: 1', 'Unnamed: 2',
       'Unnamed: 3', 'Unnamed: 4', 'Unnamed: 5', 'Unnamed: 6', 'Unnamed: 7',
       'Unnamed: 8', 'Unnamed: 9', 'Unnamed: 10', 'Unnamed: 11', 'Unnamed: 12',
       'Unnamed: 13', 'Unnamed: 14', 'Unnamed: 15'],
      dtype='object')

In [26]:
Dt.index

RangeIndex(start=0, stop=15337, step=1)

In [27]:
Dt.dtypes

C-16 POPULATION BY MOTHER TONGUE    object
Unnamed: 1                          object
Unnamed: 2                          object
Unnamed: 3                          object
Unnamed: 4                          object
Unnamed: 5                          object
Unnamed: 6                          object
Unnamed: 7                          object
Unnamed: 8                          object
Unnamed: 9                          object
Unnamed: 10                         object
Unnamed: 11                         object
Unnamed: 12                         object
Unnamed: 13                         object
Unnamed: 14                         object
Unnamed: 15                         object
dtype: object

# Cleaning up the tables to reflect attributes more correctly and to remove attributes that are unnecessary

In [51]:
Dt.columns = ["Table","State","District","Town","Area name","Mother tongue code","Mother tongue name","Total P","Total Male","Total female","3","43","65","656","88","7687"]

In [52]:
Dt

,Table,State,District,Town,Area name,Mother tongue code,Mother tongue name,Total P,Total Male,Total female,3,43,65,656,88,7687
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,Table,State,District,Town,Area name,Mother,Mother tongue name,Total,NaN,NaN,Rural,NaN,NaN,Urban,NaN,NaN
2,name,code,code,code,NaN,tongue,NaN,P,M,F,P,M,F,P,M,F
3,NaN,NaN,NaN,NaN,NaN,code,NaN,1,2,3,4,5,6,7,8,9
4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15332,C0116,29,584,626186,Bidadi (CT),022015,Urdu,913,476,437,0,0,0,913,476,437
15333,C0116,29,584,626186,Bidadi (CT),037000,37 COORGI/KODAGU,8,3,5,0,0,0,8,3,5
15334,C0116,29,584,626186,Bidadi (CT),037001,Coorgi/Kodagu,8,3,5,0,0,0,8,3,5
15335,C0116,29,584,626186,Bidadi (CT),117000,117 TULU,43,27,16,0,0,0,43,27,16
15336,C0116,29,584,626186,Bidadi (CT),117009,Tulu,43,27,16,0,0,0,43,27,16

In [54]:
Dt = Dt.iloc[5:]

In [55]:
Dt

,Table,State,District,Town,Area name,Mother tongue code,Mother tongue name,Total P,Total Male,Total female,3,43,65,656,88,7687
5,C0116,29,000,000000,KARNATAKA,001000,1 ASSAMESE,6887,4784,2103,0,0,0,6887,4784,2103
6,C0116,29,000,000000,KARNATAKA,001002,Assamese,6753,4725,2028,0,0,0,6753,4725,2028
7,C0116,29,000,000000,KARNATAKA,001999,1 Others,134,59,75,0,0,0,134,59,75
8,C0116,29,000,000000,KARNATAKA,002000,2 BENGALI,66368,39763,26605,0,0,0,66368,39763,26605
9,C0116,29,000,000000,KARNATAKA,002007,Bengali,66297,39711,26586,0,0,0,66297,39711,26586
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
15332,C0116,29,584,626186,Bidadi (CT),022015,Urdu,913,476,437,0,0,0,913,476,437
15333,C0116,29,584,626186,Bidadi (CT),037000,37 COORGI/KODAGU,8,3,5,0,0,0,8,3,5
15334,C0116,29,584,626186,Bidadi (CT),037001,Coorgi/Kodagu,8,3,5,0,0,0,8,3,5
15335,C0116,29,584,626186,Bidadi (CT),117000,117 TULU,43,27,16,0,0,0,43,27,16
15336,C0116,29,584,626186,Bidadi (CT),117009,Tulu,43,27,16,0,0,0,43,27,16

In [121]:
Dt = Dt.drop(Dt.columns[[10,11,12,13,14,15]],axis=1)
dt = Dt.rename(columns={'Area name':'Area','Index':'Code','Total P':"Total","Total Male":"Male","Total female":"Female",'Mother tongue name':'Language'})
dt = dt.iloc[:,[4,6,7,8,9,2,3,5]]

In [131]:
dt = dt.reset_index(drop=True)

In [139]:
dt

,Area,Language,Total,Male,Female,District,Town,Code
0,KARNATAKA,1 ASSAMESE,6887,4784,2103,000,000000,001000
1,KARNATAKA,Assamese,6753,4725,2028,000,000000,001002
2,KARNATAKA,1 Others,134,59,75,000,000000,001999
3,KARNATAKA,2 BENGALI,66368,39763,26605,000,000000,002000
4,KARNATAKA,Bengali,66297,39711,26586,000,000000,002007
...,...,...,...,...,...,...,...,...
15327,Bidadi (CT),Urdu,913,476,437,584,626186,022015
15328,Bidadi (CT),37 COORGI/KODAGU,8,3,5,584,626186,037000
15329,Bidadi (CT),Coorgi/Kodagu,8,3,5,584,626186,037001
15330,Bidadi (CT),117 TULU,43,27,16,584,626186,117000
15331,Bidadi (CT),Tulu,43,27,16,584,626186,117009

In [193]:
dt["Total"] = pd.to_numeric(dt["Total"])
dt.Language = dt.Language.astype('string')

In [236]:
dt.loc[dt.Language == ' Kashmiri'].sort_values(by='Total',ascending=False).head(10)

,Area,Language,Total,Male,Female,District,Town,Code
64,KARNATAKA,Kashmiri,2538,1472,1066,000,000000,008005
8488,Bangalore,Kashmiri,2183,1273,910,572,000000,008005
8815,BBMP (M Corp. + OG) (Part),Kashmiri,2169,1261,908,572,803162,008005
12310,Mysore,Kashmiri,79,39,40,577,000000,008005
12575,Mysore (M Corp. + OG),Kashmiri,76,38,38,577,803194,008005
2351,Bidar,Kashmiri,36,30,6,558,000000,008005
7971,Tumkur,Kashmiri,30,13,17,571,000000,008005
4069,Uttara Kannada,Kashmiri,29,19,10,563,000000,008005
8189,Tumkur (CMC),Kashmiri,27,11,16,571,803157,008005
10542,Dakshina Kannada,Kashmiri,24,18,6,575,000000,008005

In [249]:
glang = dt.head(357)
# There are all the languages that are known to be spoken in Karnataka according to the 2011 Census data. The first 357 rows of the table list the populations of the language speakers in all of Karnataka, so we subset that into its own table.

In [270]:
glang

          Area    Language   Total    Male  Female District    Town    Code
0    KARNATAKA  1 ASSAMESE    6887    4784    2103      000  000000  001000
1    KARNATAKA    Assamese    6753    4725    2028      000  000000  001002
2    KARNATAKA    1 Others     134      59      75      000  000000  001999
3    KARNATAKA  2 BENGALI    66368   39763   26605      000  000000  002000
4    KARNATAKA     Bengali   66297   39711   26586      000  000000  002007
..         ...         ...     ...     ...     ...      ...     ...     ...
352  KARNATAKA   122 ZEMI        7       6       1      000  000000  122000
353  KARNATAKA        Zemi       7       6       1      000  000000  122003
354  KARNATAKA    123 ZOU       19      14       5      000  000000  123000
355  KARNATAKA         Zou      19      14       5      000  000000  123001
356  KARNATAKA  124 OTHERS  229955  115462  114493      000  000000  124000

[357 rows x 8 columns]

In [283]:
glang.loc[glang.Total > 500]

          Area     Language   Total    Male  Female District    Town    Code
0    KARNATAKA   1 ASSAMESE    6887    4784    2103      000  000000  001000
1    KARNATAKA     Assamese    6753    4725    2028      000  000000  001002
3    KARNATAKA   2 BENGALI    66368   39763   26605      000  000000  002000
4    KARNATAKA      Bengali   66297   39711   26586      000  000000  002007
10   KARNATAKA     4 DOGRI      718     482     236      000  000000  004000
..         ...          ...     ...     ...     ...      ...     ...     ...
334  KARNATAKA      Tibetan    3225    2528     697      000  000000  115008
342  KARNATAKA    117 TULU   605865  295034  310831      000  000000  117000
343  KARNATAKA         Tulu  605249  294735  310514      000  000000  117009
344  KARNATAKA  117 Others      616     299     317      000  000000  117999
356  KARNATAKA   124 OTHERS  229955  115462  114493      000  000000  124000

[76 rows x 8 columns]